ChibiOS/ChibiOS-Contrib/os/hal/ports/GD/GD32VF103/TIM/hal_gpt_lld.h
#if !defined(GD32_HAS_TIM1)
#define GD32_HAS_TIM1                      FALSE
#endif

#if !defined(GD32_HAS_TIM2)
#define GD32_HAS_TIM2                      FALSE
#endif

#if !defined(GD32_HAS_TIM3)
#define GD32_HAS_TIM3                      FALSE
#endif

#if !defined(GD32_HAS_TIM4)
#define GD32_HAS_TIM4                      FALSE
#endif

#if !defined(GD32_HAS_TIM5)
#define GD32_HAS_TIM5                      FALSE
#endif

#if !defined(GD32_HAS_TIM6)
#define GD32_HAS_TIM6                      FALSE
#endif

#if !defined(GD32_HAS_TIM7)
#define GD32_HAS_TIM7                      FALSE
#endif

#if !defined(GD32_HAS_TIM8)
#define GD32_HAS_TIM8                      FALSE
#endif

#if !defined(GD32_HAS_TIM9)
#define GD32_HAS_TIM9                      FALSE
#endif

#if !defined(GD32_HAS_TIM10)
#define GD32_HAS_TIM10                     FALSE
#endif

#if !defined(GD32_HAS_TIM11)
#define GD32_HAS_TIM11                     FALSE
#endif

#if !defined(GD32_HAS_TIM12)
#define GD32_HAS_TIM12                     FALSE
#endif

#if !defined(GD32_HAS_TIM13)
#define GD32_HAS_TIM13                     FALSE
#endif

#if !defined(GD32_HAS_TIM14)
#define GD32_HAS_TIM14                     FALSE
#endif

#if !defined(GD32_HAS_TIM15)
#define GD32_HAS_TIM15                     FALSE
#endif

#if !defined(GD32_HAS_TIM16)
#define GD32_HAS_TIM16                     FALSE
#endif

#if !defined(GD32_HAS_TIM17)
#define GD32_HAS_TIM17                     FALSE
#endif

#if !defined(GD32_HAS_TIM21)
#define GD32_HAS_TIM21                     FALSE
#endif

#if !defined(GD32_HAS_TIM22)
#define GD32_HAS_TIM22                     FALSE
#endif

#if GD32_GPT_USE_TIM1 && !GD32_HAS_TIM1
#error "TIM1 not present in the selected device"
#endif

#if GD32_GPT_USE_TIM2 && !GD32_HAS_TIM2
#error "TIM2 not present in the selected device"
#endif

#if GD32_GPT_USE_TIM3 && !GD32_HAS_TIM3
#error "TIM3 not present in the selected device"
#endif

#if GD32_GPT_USE_TIM4 && !GD32_HAS_TIM4
#error "TIM4 not present in the selected device"
#endif

#if GD32_GPT_USE_TIM5 && !GD32_HAS_TIM5
#error "TIM5 not present in the selected device"
#endif

#if GD32_GPT_USE_TIM6 && !GD32_HAS_TIM6
#error "TIM6 not present in the selected device"
#endif

#if GD32_GPT_USE_TIM7 && !GD32_HAS_TIM7
#error "TIM7 not present in the selected device"
#endif

#if GD32_GPT_USE_TIM8 && !GD32_HAS_TIM8
#error "TIM8 not present in the selected device"
#endif

#if GD32_GPT_USE_TIM9 && !GD32_HAS_TIM9
#error "TIM9 not present in the selected device"
#endif

#if GD32_GPT_USE_TIM10 && !GD32_HAS_TIM10
#error "TIM10 not present in the selected device"
#endif

#if GD32_GPT_USE_TIM11 && !GD32_HAS_TIM11
#error "TIM11 not present in the selected device"
#endif

#if GD32_GPT_USE_TIM12 && !GD32_HAS_TIM12
#error "TIM12 not present in the selected device"
#endif

#if GD32_GPT_USE_TIM13 && !GD32_HAS_TIM13
#error "TIM13 not present in the selected device"
#endif

#if GD32_GPT_USE_TIM14 && !GD32_HAS_TIM14
#error "TIM14 not present in the selected device"
#endif

#if GD32_GPT_USE_TIM15 && !GD32_HAS_TIM15
#error "TIM15 not present in the selected device"
#endif

#if GD32_GPT_USE_TIM16 && !GD32_HAS_TIM16
#error "TIM16 not present in the selected device"
#endif

#if GD32_GPT_USE_TIM17 && !GD32_HAS_TIM17
#error "TIM17 not present in the selected device"
#endif

#if GD32_GPT_USE_TIM21 && !GD32_HAS_TIM21
#error "TIM21 not present in the selected device"
#endif

#if GD32_GPT_USE_TIM22 && !GD32_HAS_TIM22
#error "TIM22 not present in the selected device"
#endif

#if !GD32_GPT_USE_TIM1  && !GD32_GPT_USE_TIM2 &&                          \
    !GD32_GPT_USE_TIM3  && !GD32_GPT_USE_TIM4 &&                          \
    !GD32_GPT_USE_TIM5  && !GD32_GPT_USE_TIM6 &&                          \
    !GD32_GPT_USE_TIM7  && !GD32_GPT_USE_TIM8 &&                          \
    !GD32_GPT_USE_TIM9  && !GD32_GPT_USE_TIM10 &&                         \
    !GD32_GPT_USE_TIM11 && !GD32_GPT_USE_TIM12 &&                         \
    !GD32_GPT_USE_TIM13 && !GD32_GPT_USE_TIM14 &&                         \
    !GD32_GPT_USE_TIM15 && !GD32_GPT_USE_TIM16 &&                         \
    !GD32_GPT_USE_TIM17 &&                                                 \
    !GD32_GPT_USE_TIM21 && !GD32_GPT_USE_TIM22
#error "GPT driver activated but no TIM peripheral assigned"
#endif

/* Checks on allocation of TIMx units.*/
#if GD32_GPT_USE_TIM1
#if defined(GD32_TIM1_IS_USED)
#error "GPTD1 requires TIM1 but the timer is already used"
#else
#define GD32_TIM1_IS_USED
#endif
#endif

#if GD32_GPT_USE_TIM2
#if defined(GD32_TIM2_IS_USED)
#error "GPTD2 requires TIM2 but the timer is already used"
#else
#define GD32_TIM2_IS_USED
#endif
#endif

#if GD32_GPT_USE_TIM3
#if defined(GD32_TIM3_IS_USED)
#error "GPTD3 requires TIM3 but the timer is already used"
#else
#define GD32_TIM3_IS_USED
#endif
#endif

#if GD32_GPT_USE_TIM4
#if defined(GD32_TIM4_IS_USED)
#error "GPTD4 requires TIM4 but the timer is already used"
#else
#define GD32_TIM4_IS_USED
#endif
#endif

#if GD32_GPT_USE_TIM5
#if defined(GD32_TIM5_IS_USED)
#error "GPTD5 requires TIM5 but the timer is already used"
#else
#define GD32_TIM5_IS_USED
#endif
#endif

#if GD32_GPT_USE_TIM6
#if defined(GD32_TIM6_IS_USED)
#error "GPTD6 requires TIM6 but the timer is already used"
#else
#define GD32_TIM6_IS_USED
#endif
#endif

#if GD32_GPT_USE_TIM7
#if defined(GD32_TIM7_IS_USED)
#error "GPTD7 requires TIM7 but the timer is already used"
#else
#define GD32_TIM7_IS_USED
#endif
#endif

#if GD32_GPT_USE_TIM8
#if defined(GD32_TIM8_IS_USED)
#error "GPTD8 requires TIM8 but the timer is already used"
#else
#define GD32_TIM8_IS_USED
#endif
#endif

#if GD32_GPT_USE_TIM9
#if defined(GD32_TIM9_IS_USED)
#error "GPTD9 requires TIM9 but the timer is already used"
#else
#define GD32_TIM9_IS_USED
#endif
#endif

#if GD32_GPT_USE_TIM10
#if defined(GD32_TIM10_IS_USED)
#error "GPTD10 requires TIM10 but the timer is already used"
#else
#define GD32_TIM10_IS_USED
#endif
#endif

#if GD32_GPT_USE_TIM11
#if defined(GD32_TIM11_IS_USED)
#error "GPTD11 requires TIM11 but the timer is already used"
#else
#define GD32_TIM11_IS_USED
#endif
#endif

#if GD32_GPT_USE_TIM12
#if defined(GD32_TIM12_IS_USED)
#error "GPTD12 requires TIM12 but the timer is already used"
#else
#define GD32_TIM12_IS_USED
#endif
#endif

